app/Controllers/Consulta_controller.php

    public function ver_consulta(){
        $consulta_model = new Consultas_models();
        $data['titulo'] = 'Consultas';

        $datos['consultas'] = $consulta_model->orderBy('id_consulta','asc')->findAll();
---
SELECT *
FROM `consultas`
ORDER BY `id_consulta` ASC