app/Controllers/Usuario_controller.php

    public function dashboard(){
        //Si el perfil el ADM
        if(session()->get('perfil_id') == '1'){
        $consulta_model = new Consultas_models();
        $data['titulo']='ADM';
        $datos['consultas'] = $consulta_model->orderBy('id_consulta','asc')->findAll();
---
SELECT *
FROM `consultas`
ORDER BY `id_consulta` ASC