app/Controllers/Ventas_controller.php

INSERT INTO `ventas_cabecera` (`usuario_id`, `total_venta`) VALUES ('15', 1500)
INSERT INTO `ventas_detalle` (`venta_id`, `producto_id`, `cantidad_venta`, `precio_venta`) VALUES (80, '62', 2, 500)
---
            ];


            $db->table('ventas_cabecera')->insert($datos_vcabaza);  $db->table('ventas_detalle')->insert($datos_vdetalle);